USE burgermi;
-- DROP TABLE recipes;

CREATE TABLE recipes ( NAME VARCHAR(20) NOT NULL, ingredient VARCHAR(50) NOT NULL, kind VARCHAR(10) NOT NULL,
PRIMARY KEY(NAME), FOREIGN KEY (NAME) REFERENCES menu (NAME));

INSERT INTO recipes (NAME, ingredient, kind) VALUES 
					  ('디폴트 버거', '기본아래빵;패티;양파;기본윗빵', '햄버거'),
					  ('함박 버거', '기본아래빵;패티;치즈;기본윗빵', '햄버거'),
					  ('치즈 버거', '기본아래빵;패티;치즈;토마토;기본윗빵', '햄버거'),
					  ('불고기 버거','기본아래빵;패티;양상추;양파;기본윗빵', '햄버거'),
					  ('채식 버거', '깨아래빵;양상추;토마토;계란;양파;깨윗빵', '햄버거'),
					  ('계란치즈 버거', '깨아래빵;패티;치즈;계란;양상추;깨윗빵', '햄버거'),
					  ('더블치즈 버거', '깨아래빵;패티;치즈;패티;치즈;양상추;깨윗빵', '햄버거'),
					  ('오버플로 버거', '깨아래빵;양상추;치즈;패티;양파;아래빵;양상추;토마토;패티;깨윗빵', '햄버거'),
					  
					  ('모닝 머핀', '모닝아래빵;패티;치즈;모닝윗빵', '모닝'),
					  ('계란 머핀', '모닝아래빵;치즈;계란;모닝윗빵', '모닝'),
					  ('햄모닝 머핀', '모닝아래빵;패티;치즈;계란;모닝윗빵', '모닝'),
					  ('토마토햄 머핀', '모닝아래빵;치즈;패티;양상추;토마토;모닝윗빵', '모닝'),
					  
					  ('감자튀김', '감자튀김', '사이드 메뉴'),
					  ('치킨너겟', '치킨너겟', '사이드 메뉴'),
					  ('치즈스틱', '치즈스틱', '사이드 메뉴'),
					  ('아이스크림', '아이스크림', '사이드 메뉴'),
					  ('콘샐러드', '콘샐러드',  '사이드 메뉴'),
					  
					  ('콜라', '콜라', '음료'),
					  ('사이다', '사이다', '음료'),
					  ('환타', '환타', '음료'),
					  ('커피', '커피', '음료'),
					  ('오렌지 주스', '오렌지 주스', '음료'),
					  
					  ('채소없는 채식 버거', '깨아래빵;계란;깨윗빵', '햄버거'),
					  ('탄산없는 콜라', '콜라', '음료'),
					  ('탄산없는 환타', '환타', '음료')
					  
					  ;					  