USE burgermi;
DROP TABLE recipes;

CREATE TABLE recipes ( NAME VARCHAR(20) NOT NULL, ingredients VARCHAR(50) NOT NULL, kind VARCHAR(10) NOT NULL,
PRIMARY KEY(NAME), FOREIGN KEY (NAME) REFERENCES menu (NAME));

INSERT INTO recipes (NAME, ingredients, kind) VALUES 
					  ('디폴트 버거', '기본아래빵;패티;양파;기본윗빵', '햄버거'),
					  ('함박 버거', '기본아래빵;패티;치즈;기본윗빵', '햄버거'),
					  ('치즈 버거', '기본아래빵;패티;치즈;토마토;기본윗빵', '햄버거'),
					  ('불고기 버거','기본아래빵;패티;양상추;양파;기본윗빵', '햄버거'),
					  ('채식 버거', '깨아래빵;양상추;토마토;계란;양파;깨윗빵', '햄버거'),
					  ('계란치즈 버거', '깨아래빵;패티;치즈;계란;양상추;깨윗빵', '햄버거'),
					  ('더블치즈 버거', '깨아래빵;패티;치즈;패티;치즈;양상추;깨윗빵', '햄버거'),
					  
					  ('모닝 머핀', '모닝아래빵;패티;치즈;모닝윗빵', '모닝'),
					  ('계란 머핀', '모닝아래빵;치즈;계란;모닝윗빵', '모닝'),
					  ('햄모닝 머핀', '모닝아래빵;패티;치즈;계란;모닝윗빵', '모닝'),
					  ('토마토햄 머핀', '모닝아래빵;치즈;패티;양상추;토마토;모닝윗빵', '모닝'),
					  
					  ('감자튀김', '감자튀김', '사이드메뉴'),
					  ('치킨너겟', '치킨너겟', '사이드메뉴'),
					  ('치즈스틱', '치즈스틱', '사이드메뉴'),
					  ('아이스크림', '아이스크림', '사이드메뉴'),
					  ('콘샐러드', '콘샐러드',  '사이드메뉴'),
					  ('치즈볼', '치즈볼', '사이드메뉴'),
					  
					  ('콜라', '콜라', '음료'),
					  ('사이다', '사이다', '음료'),
					  ('환타', '환타', '음료'),
					  ('커피', '커피', '음료'),
					  ('오렌지 주스', '오렌지 주스', '음료'),
					  ('레몬에이드', '레몬에이드', '음료'),
					  
					  ('오버플로 버거', '깨아래빵;양상추;치즈;패티;양파;깨아래빵;양상추;토마토;패티;깨윗빵', '햄버거'),
					  ('불고기버거에서 불고기만', '패티;패티;패티;패티;패티', '햄버거'),
					  ('채소없는 채식 버거', '깨아래빵;계란;깨윗빵', '햄버거'),
					  ('치즈만 있는 치즈버거', '기본아래빵;치즈;치즈;치즈;기본윗빵', '햄버거'),
					  ('빵 없는 버거', '패티;양상추;계란;치즈;토마토;패티', '햄버거'),
					  ('샐러드', '양상추;양상추;양상추', '햄버거'),
					  
					  ('탄산없는 콜라', '콜라', '음료'),
					  ('탄산없는 환타', '환타', '음료')
					  
					  ;					  